---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsOccupied
source: html/34cc2ad3-6171-5c98-18c2-2794602c3e75.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FeedThroughLugsIsOccupied Property

The feed through lugs is in use by circuit [Element].

## Syntax (C#)
```csharp
public static FailureDefinitionId FeedThroughLugsIsOccupied { get; }
```